#include <cmath>
#include <iostream>

using namespace std;

int main() {
  while (true) {
    float x, y;
    cout
        << "Программа по определению принадлежности точки заштрихованной части "
           "плоскости "
        << endl;
    cout << "----------------------------------" << endl;
    cout << "Введите координату x" << endl;
    cin >> x;
    cout << "Введите координату y" << endl;
    cin >> y;
    cout << "----------------------------------" << endl;
    if (x > 1.0 || x < -2.0) {
      cout << "Точка не принадлежит заштрихованной плоскости" << endl;
    } else {
      if (x >= 0) {
        if ((pow(x, 2) + pow(y, 2)) > 1) {
          cout << "Точка не принадлежит заштрихованной плоскости" << endl;
        } else {
          cout << "Точка принадлежит заштрихованной плоскости" << endl;
        }
      } else {
        if (y >= 0) {
          if (y <= (x * 0.5 + 1)) {
            cout << "Точка принадлежит заштрихованной плоскости" << endl;
          } else {
            cout << "Точка не принадлежит заштрихованной плоскости" << endl;
          }
        } else {
          if (y >= (x * -0.5 - 1)) {
            cout << "Точка принадлежит заштрихованной плоскости" << endl;
          } else {
            cout << "Точка не принадлежит заштрихованной плоскости" << endl;
          }
        }
      }
    }
    cout << "----------------------------------" << endl;
  }
  return 0;
}
