#include <iostream>

using namespace std;

int main() {
  float x, y;
  cout << "Программа по определению принадлежности точки заштрихованной части плоскости "
       << endl;
  cout << "----------------------------------" << endl;
  cout << "Введите координату x" << endl;
  cin >> x;
  cout << "Введите координату y" << endl;
  cin >> y;
  cout << "----------------------------------" << endl;
  if (x > 1.0 || x < -2.0) {
    cout << "Точка не принадлежит заштрихованной плоскости" << endl;
  } else {
    if (y > 1.0 || y < -1.0) {
      cout << "Точка не принадлежит заштрихованной плоскости" << endl;
    } else {
      cout << "Точка принадлежит заштрихованной плоскости" << endl;
    }
  }
  cout << "----------------------------------" << endl;
  return 0;
}